{"id":272,"date":"2022-05-18T18:55:45","date_gmt":"2022-05-18T18:55:45","guid":{"rendered":"https:\/\/wp1.chest.gg\/?p=238"},"modified":"2022-05-18T18:55:45","modified_gmt":"2022-05-18T18:55:45","slug":"nip-reportedly-pays-csgo-players-stickers-money","status":"publish","type":"post","link":"https:\/\/monk-theme.pxsquad.com\/demo2\/nip-reportedly-pays-csgo-players-stickers-money\/","title":{"rendered":"NiP reportedly pays CS:GO players stickers money"},"content":{"rendered":"\n<p>Ninjas in Pyjamas is allegedly in dispute with some of its current and former&nbsp;<em>CS:GO<\/em>&nbsp;players over sticker money from the ESL One: Rio Major 2020, according to&nbsp;<a href=\"https:\/\/www.dexerto.com\/csgo\/sources-nip-in-dispute-with-csgo-players-over-sticker-money-1825180\/\" target=\"_blank\" rel=\"noreferrer noopener\">Dexerto’s Richard Lewis<\/a>. The tournament was supposed to be organized by ESL, though, it was canceled due to COVID-19 pandemic.<\/p>\n\n\n<p>The event, however, was canceled after the in-game capsules had already been on sale. As the report states, Tim “nawwk” Jonasson, who was an active player of the NiP roster at the time, “believes they have a contractual claim to the earnings from the sticker sales,” which hasn’t been paid to the players.<\/p>\n\n\n<p>And the amount of money that is supposed to be withdrawn to each player is said to be from $200,000 to $300,000. The report explains nawwk is aiming to take legal action against the organization in order to get it to pay the money it owes to the individuals.<\/p>\n\n\n<p>Nawwk’s claim is said to be&nbsp;<a href=\"https:\/\/imgur.com\/a\/m7fux8q\" target=\"_blank\" rel=\"noreferrer noopener\">held in section 5.4 of their player contracts<\/a>, which says each player “shall receive 100% of the individual stickers money, which is allocated to the players.” Additionally, individuals are expected to be given 83.33 percent of the team stickers money, divided between them.<\/p>\n\n\n<p>The report also provides a response from Jonas “calc” Gundersen, NiP’s Chief Operating Officier, which was supposedly sent to the players in a group text chat. According to the report, he said: “These were ‘Capsules’ created by the teams, and Ok’d by Valve, in order to survive the pandemic and keep paying salaries without any cuts, despite the complete lack of sponsorships and exposure,” it reads. “Therefore it’s not stickers as it would be normally – because there was no major. This was a desperation move for many teams because elseway something like half would have pulled out of CS:GO altogether.”<\/p>\n\n\n<p>Gundersen follows by explaining he knows many teams had a different approach to this topic, with some paying “portions out to the players.” NiP, though, decided not to do that and “keep salaries and business” running as usual, likely due to the money earned through the stickers. The goal of these actions was to support the infrastructure within the organization to “make it an even better place to win majors.”<\/p>\n\n\n<p>Last but not least, the report claims three players from that time, Fredrik “REZ” Sterner, Nicolas “Plopski” Gonzalez Zamora, and Hampus “hampus” Poser, don’t wish to talk about the topic to the public.<\/p>\n\n\n<p>Ninjas in Pyjamas has been in a similar spotlight in the past. The outlet adds that in 2015, the organization owed $340,000 in sticker sales and prize money, which resulted in Per Lilliefelth, the CEO back then, leaving NiP.<\/p>\n\n\n<p>Currently, NiP’s&nbsp;<em>CS:GO<\/em>&nbsp;division is participating in PGL Antwerp Major, where it qualified for the Champions Stage, which begins on Thursday, May 19.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ninjas in Pyjamas is allegedly in dispute with some of [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":290,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[16],"tags":[],"_links":{"self":[{"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/posts\/272"}],"collection":[{"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/comments?post=272"}],"version-history":[{"count":0,"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/posts\/272\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/media\/290"}],"wp:attachment":[{"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/media?parent=272"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/categories?post=272"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/monk-theme.pxsquad.com\/demo2\/wp-json\/wp\/v2\/tags?post=272"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}